app/controllers/index_controller.rb

  def index
    num_error = 0
    n = params[:n]
    @res = []
    if is_number?(n)
      if n.to_i <= 10 ** 6
        respond_to do |format|
          format.html
          format.json do
            render json: { value: Palindrome.where(value: n).first_or_create.get_resulte }
---
INSERT INTO "palindromes" ("value", "res", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT "palindromes".* FROM "palindromes" WHERE "palindromes"."value" = ? ORDER BY "palindromes"."id" ASC LIMIT ?  [["value", "234"], ["LIMIT", 1]]