app/controllers/session_controller.rb

  def create
   user = User.find_by_name(params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "awe"], ["LIMIT", 1]]